// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка). 7 -> нет
Console.WriteLine("Дано число: 7, четное ли оно? ");
double numberA = 7;

            if (numberA % 2 == 1)  
            {
                Console.WriteLine("Число " + numberA + " является: НЕЧЁТНЫМ");
            
            }
            
            else
            {
                Console.WriteLine("Число " + numberA + " является: ЧЁТНЫМ");
            }
