// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка). 4 -> да
Console.WriteLine("Дано число: 4, четное ли оно? ");
double numberA = 4;

            if (numberA % 2 == 1)  
            {
                Console.WriteLine("Число " + numberA + " является: НЕЧЁТНЫМ");
            
            }
            
            else
            {
                Console.WriteLine("Число " + numberA + " является: ЧЁТНЫМ");
            }
